Repository: Fabo/regexxer
Catalog: po/*.po
Languages: ta

source: Search and replace using regular expressions
ta: வழக்கமான கூற்¨ற உபயோகித்து தேடு மற்றும் மாற்று

source: regexxer Search Tool
ta: regexxer தேடுகின்ற கருவி

source: Current-match color
ta: தற்§ப¡¨தய - வண்ணப்¦À¡Õத்தம்

source: Fallback encoding
ta: பின்சா÷தலின் குறியீட்டல்'

source: Match color
ta: வண்ணப்¦À¡Õத்தம்

source: Text view font
ta: ±ØòÐÕவின் ¯¨Ãக்காட்சி

source: The background color used to highlight matches of the search expression.
ta: §¾Îகின்ற கூற்றின் பொருத்தத்¨த தனிப்படுத்துவதற்காக பின்னனிவண்ணத்¨த உபயோகப்படுத்தலாம்`

source: The background color used to highlight the currently selected match of the search expression.
ta: §¾Îகின்ற கூற்றிற்கான தனிப்படுத்துவதற்காக தற்§ப¡து §¾÷ó¦¾Îக்கப்பட்ட பின்னனிவண்ணத்¨த உபயோகப்படுத்தலாம்

source: The font used in the file editor.
ta: §¸¡ôÒப்பதிப்பானில் உபயோகப்படுத்துகின்ற ±ØòÐÕ.

source: The style of the application’s toolbar. Possible values are “icons”, “text”, “both”, and “both-horiz”.
ta: பயன்பாட்டு கருவிப்பட்¨டயின் பாணி. சாத்தியமான மதிப்புகள் "குரும்படம்","உரை","இரண்டும்", மற்றும் "இரண்டும்-இடம்வல".

source: Toolbar style
ta: கருவிப்பட்¨டயின் பாணி

source: Can’t read file:
ta: §¸¡ô¨ப படிக்க முடியாது

source: File
ta: §¸¡ôÒ

source: Failed to save file “%1”: %2
ta: §¸¡ôÒக¨ள §º¸Ã¢க்க இயலவில்¨ல “%1”: %2

source: “%1” seems to be a binary file.
ta: “%1”þÕ¿¢¨Äì §¸¡ôபை பொல தெரிகிறது.

source: Save _all
ta: «¨ÉòÐõ §º¸Ã¢

source: Find files matching PATTERN
ta: பொருத்தமான Óý ÅÊÅக் கோப்¨ப ¸ñÎÀ¢Ê

source: PATTERN
ta: Óý ÅÊÅõ

source: Do not recurse into subdirectories
ta: ¯À «¨¼×¸ளில் மறுசுழல் செய்யாதே

source: Also find hidden files
ta: Á¨Èó¾ §¸¡ôÒக¨ளயும் ¸ñÎÀ¢Ê

source: Find text matching REGEX
ta: ¯¨Ãய¡ன REGEX ¨ய ¸ñÎÀ¢Ê

source: Find only the first match in a line
ta: வரியில் இருக்கும் முதல் பொருத்தத்¨த மட்டும் கண்டுபிடி

source: Do case insensitive matching
ta: ±ØòÐÕ ¯½ர்வின்றி பொருத்துக

source: Replace matches with STRING
ta: ¦¾¡¼÷îº¢ ¯¼ý பொருத்தமானவற்¨ற மாற்று

source: STRING
ta: ¦¾¡¼÷îº¢

source: Print match location to standard output
ta: இயல்பான வெளியிட்டில் பொருத்தமான இடத்¨த அச்சிடி

source: Do not automatically start search
ta: தேடுவதை தானாக துவக்காதே

source: Some files haven’t been saved yet. Quit anyway?
ta: சில கோப்புகள் இன்னும் சேமிக்கபடவில்¨ல. என்னவாக இருந்தாலும் வெளியேறு?

source: Some files haven’t been saved yet. Continue anyway?
ta: சில கோப்புகள் இன்னும் சேமிக்கபடவில்¨ல. என்னவாக இருந்தாலும் தொடர்க?

source: The file search pattern is invalid.
ta: கோப்பு தேடும் முன்வடிவம் ¦ºøÄ¡Ð

source: The following errors occurred during search:
ta: இப்பிழைகள் தேடும் போது நேர்ந்தன:

source: The following errors occurred during save:
ta: இப்பிழைகள் சேமிக்கும் போது நேர்ந்தன:

source: translator-credits
ta: மொழிபெயர்ப்பு நிரல்-புகழ்கள்

source: Using the \C escape sequence to match a single byte is not supported.
ta: ஒரு பைட்¨டப் பொருத்த \C என்ற escape sequenceஐ உபயோகிக்க துணையில்¨ல.

source: Error in regular expression at “%1” (index %2): %3
ta: ÅÆì¸Á¡É தொடரில் பிழை at “%1” (index %2): %3

source: Error in regular expression: %1
ta: ÅÆì¸Á¡É தொடரில் பிழை: %1

source: Reached the recursion and backtracking limit of the regular expression engine.
ta: வழக்கமான கூற்றுப் பொறியின் பின் நகர்வு வரம்பு மற்றும் மறுகழற்சியை அடைந்துவிட்டது.

source: “%1” is not a valid encoding.
ta: “%1” இந்த குறியாக்கம் செல்லாது.

source: Stop
ta: நிருத்து

source: File:
ta: கோப்பு:

source: Match:
ta: பொருத்த:

source: Cancels the running search
ta: இயங்குநிலையில் இருக்கும் தேடலை ரத்து செய்

source: A regular expression in Perl syntax
ta: ÅÆì¸Á¡É தொடரின் Perl þÄì¸½ம்

source: Backward
ta: À¢ýÀì¸Á¡¸

source: File backward
ta: கோப்பு பின் நொக்கு

source: File forward
ta: கோப்பு முன்

source: Find all files that match the filename pattern
ta: கோப்புப் பெயரின் முன் வடிவத்துடன் பொருந்தும் அனைத்து கோப்புக்களையும் கண்டுபிடி

source: Find all matches of the regular expression
ta: ÅÆì¸Á¡É தொடருடன் பொருந்தும் அனைத் தையும் கண்டுபிடி

source: Find all possible matches in a line
ta: §¸¡ட்டில் சாத்தியமான அனைத்துப் பொருத்தங்களையும் கண்டுபிடி

source: Find fi_les
ta: கோ_ப்புகளை கண்டுபிடி

source: Fol_der:
ta: ஆ_வனம்

source: Forward
ta: முன்

source: Go to next match
ta: அடுத்த பொருத்தத்திற்குச் செல்

source: Go to previous match
ta: முந்¨தய பொருத்தத்திற்குச் செல்

source: Go to the next matching file
ta: அடுத்து பொருந்தியிருக்கும் கோப்புக்குச் செல்

source: Go to the previous matching file
ta: முந்¨தய பொருந்தியிருக்கும் கோப்புக்குச் செல்

source: Pattern:
ta: வடிவம்

source: Preview
ta: முன்பார்¨வ

source: Preview of the substitution
ta: பதிலியின் முன்பார்¨வ

source: Recurse into subdirectories
ta: மீண்டும் உபஅடைவுகளுக்குள்

source: Replace _current
ta: _தற்§À¡தையை மாற்று

source: Replace all matches in all files
ta: அணைத்து கோப்புகளிலும் உள்ள அணைத்துப் பொருத்தங்களையும் மாற்று

source: Replace all matches in the current file
ta: தற்§À¡தைய கோப்பில் உள்ள அணைத்துப் பொருத்தங்களையும் மாற்று

source: Replace current match
ta: தற்§À¡தைய பொருத்தங்களை மாற்று

source: Replace in _all files
ta: _அணைத்து கோப்புகளிலும் மாற்று

source: Replace in _this file
ta: இந்த கோப்பில் உள்ளதை மாற்று

source: Replace:
ta: மாற்று:

source: Search:
ta: தேடு:

source: The new string to substitute. As in Perl, you can refer to parts of the match using $1, $2, etc. or even $+, $&, $` and $'. The operators \l, \u, \L, \U and \E are supported as well.
ta: ஈடுசெய்வதற்கான புதிய சரம்.Perlல் உள்ளது போல், $1, $2, அல்லது $+, $&, $` மற்றும் $' ஆகியவற்¨ற உபயோகித்து பொருத்தத்தில் உள்ள பாகங்க¨ள நீங்கள் ஆலோசிக்கலாம். \l, \u, \L, \U மற்றும் \E ஆகிய இயக்கிகளுக்கும் துணையிருக்கும்.

source: _All files
ta: _அனைத்து கோப்புகள்

source: _Edit
ta: _சீரமைப்பு

source: _File
ta: _கோப்பு

source: _Help
ta: _உதவி

source: _Match
ta: _பொருத்தம்

source: _Next file
ta: _அடுத்த கோப்பு

source: _Previous file
ta: _முந்¨தய கோப்பு

source: _Replace
ta: _மாற்று

source: _This file
ta: _இந்த கோப்பு

source: hidden
ta: மறைந்த

source: recursive
ta: மீண்டும்

source: C_urrent match color:
ta: த_ற்§À¡தைய பொருந்தும் வண்ணம்

source: Fallback _encoding:
ta: பின் சார்தல் _குறியாக்கம்

source: Icons only Text only Icons and text Both horizontal
ta: சின்னங்கள் மட்டும் உரை மட்டும் சின்னங்கள் மற்றும் உரை இரண்டும் இடம்வலமாக

source: Preferences
ta: விருப்பங்கள்

source: The encoding specified by the current locale
ta: தற்§À¡தைய உள்ளூரால் சொல்லப்பட்ட குறியாக்கம்

source: Tool_bar style:
ta: கருவி_பட்¨டயின் பாணி:

source: _File access
ta: _கோப்பு அணுகல்

source: _Look’n’feel
ta: _பார்த்து உணர்

source: _Match color:
ta: _வண்ணப் பொருத்தம்

source: _Text view font:
ta: _உரை காட்சி எழுத்துரு:

source: regexxer attempts to read a file in the following encodings before giving up:
ta: விடுவதற்கு முன் regexxer கீழ்கண்ட குறியாக்கங்களில் உள்ள கோப்¨ப படிக்க முயற்சி செய்கிறது:
